# Pandas Data Structure

## Case 1: Mengolah Nilai Mahasiswa

In [1]:
import pandas as pd

In [2]:
# buat data nilai dalam bentuk python dictionary
data_nilai = {
    "Juchiro": 83.54,
    "Fandy":86.79,
    "Erlangga":88.57,
    "Matheos":71.48,
    "Sugeng":72.65,
    "Atma":92.73,
    "Muliana":83.22,
    "Iyya":77.72,
    "Budiarto":85.09,
    "Afendy":88.98,
    "Muhaimin":68.40,
}

In [17]:
nilai_mahasiswa = pd.Series(data_nilai)
nilai_mahasiswa

Juchiro     83.54
Fandy       86.79
Erlangga    88.57
Matheos     71.48
Sugeng      72.65
Atma        92.73
Muliana     83.22
Iyya        77.72
Budiarto    85.09
Afendy      88.98
Muhaimin    68.40
dtype: float64

In [4]:
# tampilkan nilai Fandy
print(f"Nilai Fandy: {nilai_mahasiswa['Fandy']}")

Nilai Fandy: 86.79

In [7]:
# tampilkan nilai Sugeng, Budiarto, dan Muhaimin
print("Nilai Sugeng, Budiarto, dan Muhaimin")
print(nilai_mahasiswa[['Sugeng', 'Budiarto', 'Muhaimin']])

Nilai Sugeng, Budiarto, dan Muhaimin
Sugeng      72.65
Budiarto    85.09
Muhaimin    68.40
dtype: float64

In [18]:
# buat data baru dalam bentuk python dictionary
new_data_nilai = {
    "Yusril": 86.35,
    "Priyo":74.73,
    "Yosua":79.12
}

# tambahkan nilai baru ke dalam data sebelumnya
nilai_mahasiswa = pd.concat([nilai_mahasiswa, pd.Series(new_data_nilai)])
nilai_mahasiswa

Juchiro     83.54
Fandy       86.79
Erlangga    88.57
Matheos     71.48
Sugeng      72.65
Atma        92.73
Muliana     83.22
Iyya        77.72
Budiarto    85.09
Afendy      88.98
Muhaimin    68.40
Yusril      86.35
Priyo       74.73
Yosua       79.12
dtype: float64

Export data terbaru menjadi csv

In [12]:
nilai_mahasiswa.to_csv('nilai_mahasiswa_updated.csv')

### Exercise

1. Ubah nilai Afendy dan Sugeng masing-masing menjadi 85.5 dan 77.77 
2. Ubah data nilai tersebut menjadi rentang nilai 1-10
3. Hapus nilai Matheos dan Fandy
4. Export data menjadi data excel

In [19]:
# ubah nilai Afendy dan Sugeng
nilai_mahasiswa['Afendy'], nilai_mahasiswa['Sugeng'] = 85.5, 77.77

In [20]:
# ubah rentang nilai menjadi 1-10
nilai_mahasiswa /= 10
nilai_mahasiswa

Juchiro     8.354
Fandy       8.679
Erlangga    8.857
Matheos     7.148
Sugeng      7.777
Atma        9.273
Muliana     8.322
Iyya        7.772
Budiarto    8.509
Afendy      8.550
Muhaimin    6.840
Yusril      8.635
Priyo       7.473
Yosua       7.912
dtype: float64

In [21]:
# hapus nilai Matheos dan Fandy
nilai_mahasiswa.drop(['Matheos', 'Fandy'], inplace=True)

In [22]:
nilai_mahasiswa

Juchiro     8.354
Erlangga    8.857
Sugeng      7.777
Atma        9.273
Muliana     8.322
Iyya        7.772
Budiarto    8.509
Afendy      8.550
Muhaimin    6.840
Yusril      8.635
Priyo       7.473
Yosua       7.912
dtype: float64

In [23]:
nilai_mahasiswa.to_excel('nilai_mahasiswa_updated.xlsx')

### Case 2: Data Pelanggan Mall

In [71]:
mall_cust = pd.read_csv('Mall_Customers.csv')
mall_cust.head()

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40

Index pada data merupakan angka dari 0 hingga 199. Anda diminta untuk mengubah Index menjadi angka hasil penjumlahan 1000 dengan "CustomerID". Misalnya CustomerID = 9, index menjadi 1009. Kemudian hapus  kolom "CustomerID"

In [72]:
id_customer = mall_cust['CustomerID'] + 1000
mall_cust.index = id_customer

mall_cust.head()

            CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
CustomerID
1001                 1    Male   19                  15              39
1002                 2    Male   21                  15              81
1003                 3  Female   20                  16               6
1004                 4  Female   23                  16              77
1005                 5  Female   31                  17              40

Hapus kolom CustomerID

In [73]:
mall_cust.drop('CustomerID', axis=1, inplace=True)

In [74]:
mall_cust.head()

             Genre  Age  Annual_Income_(k$)  Spending_Score
CustomerID
1001          Male   19                  15              39
1002          Male   21                  15              81
1003        Female   20                  16               6
1004        Female   23                  16              77
1005        Female   31                  17              40

Customer 1098 dan 1099 tidak lagi menjadi pelanggan pada mall tersebut. Anda diminta untuk menghapus data index 1098 dan 1099.

In [75]:
mall_cust.drop(index=[1098, 1099], axis=0, inplace=True)

In [76]:
# buat dataframe dari data baru tersebut
new_row = pd.DataFrame({
    "Genre": "Male", 
    "Age": 22, 
    "Annual_Income_(k$)": 20,
    "Spending_Score": 83 },
    index = [1201])

# tampilkan data baru
new_row

     Genre  Age  Annual_Income_(k$)  Spending_Score
1201  Male   22                  20              83

In [77]:
# tambahkan data baru ke data yg sudah ada sebelumnya
mall_cust = pd.concat([mall_cust, new_row], axis=0)
mall_cust

       Genre  Age  Annual_Income_(k$)  Spending_Score
1001    Male   19                  15              39
1002    Male   21                  15              81
1003  Female   20                  16               6
1004  Female   23                  16              77
1005  Female   31                  17              40
...      ...  ...                 ...             ...
1197  Female   45                 126              28
1198    Male   32                 126              74
1199    Male   32                 137              18
1200    Male   30                 137              83
1201    Male   22                  20              83

[199 rows x 4 columns]

Data income dan score kedepannya berpotensi berisi data float. Ubah type data income dan score menjadi float.

In [78]:
mall_cust['Annual_Income_(k$)'] = mall_cust['Annual_Income_(k$)'].astype('float')
mall_cust['Spending_Score'] = mall_cust['Spending_Score'].astype('float')

mall_cust.dtypes

Genre                  object
Age                     int64
Annual_Income_(k$)    float64
Spending_Score        float64
dtype: object

1. Ubah masing-masing header sesuai data berikut:
  * Genre = JenisKelamin
  * Age = Umur
  * Annual_Income_(k$) = Pendapatan
  * Spending_Score = Skor
2. Tambah data berikut:

||JenisKelamin|Umur|Pendapatan|Skor
|-|-|-|-|-|
|1202|Male|23|100.5|50.4
|1205|Female|45|70.5|35.6
|1207|Male|35|88.3|54.8

3. Ubah umur data index 1200 menjadi 31 dan Update data index 1002 menjadi:

||JenisKelamin|Umur|Pendapatan|Skor
|-|-|-|-|-|
|1002|Male|22|20|83

4. Export data menjadi data excel

In [79]:
mall_cust.columns = ['JenisKelamin', 'Umur', 'Pendapatan', 'Skor']
mall_cust

     JenisKelamin  Umur  Pendapatan  Skor
1001         Male    19        15.0  39.0
1002         Male    21        15.0  81.0
1003       Female    20        16.0   6.0
1004       Female    23        16.0  77.0
1005       Female    31        17.0  40.0
...           ...   ...         ...   ...
1197       Female    45       126.0  28.0
1198         Male    32       126.0  74.0
1199         Male    32       137.0  18.0
1200         Male    30       137.0  83.0
1201         Male    22        20.0  83.0

[199 rows x 4 columns]

In [80]:
# tambah 3 data berikut
data_baru = {
    'JenisKelamin': ['Male', 'Female', 'Male'],
    'Umur': [23, 45, 35],
    'Pendapatan': [100.5, 70.5, 88.3],
    'Skor': [50.4, 35.6, 54.8]
}

mall_cust = pd.concat([mall_cust, pd.DataFrame(data_baru, index=[1202, 1205, 1207])], axis=0)
mall_cust

     JenisKelamin  Umur  Pendapatan  Skor
1001         Male    19        15.0  39.0
1002         Male    21        15.0  81.0
1003       Female    20        16.0   6.0
1004       Female    23        16.0  77.0
1005       Female    31        17.0  40.0
...           ...   ...         ...   ...
1200         Male    30       137.0  83.0
1201         Male    22        20.0  83.0
1202         Male    23       100.5  50.4
1205       Female    45        70.5  35.6
1207         Male    35        88.3  54.8

[202 rows x 4 columns]

In [83]:
# update data umur index 1200 menjadi 31
mall_cust.loc[1200, ['Umur']] = 31
mall_cust.loc[1200, :]

JenisKelamin     Male
Umur               31
Pendapatan      137.0
Skor             83.0
Name: 1200, dtype: object

In [85]:
# update data index 1002
mall_cust.loc[1002, :] = ['Male', 22, 20, 83]
mall_cust.loc[1002, :]

JenisKelamin    Male
Umur              22
Pendapatan      20.0
Skor            83.0
Name: 1002, dtype: object

In [86]:
# export data menjadi excel
mall_cust.to_excel('mall_customers_updated.xlsx')

## Study Case 3: Menggabungkan data pasien rumah sakit dari file berbeda.
Ada 4 file dari 2 rumah sakit yang berbeda yang harus anda gabung.
* File "patient_A1.csv" merupakan data pasien dari rumah sakit A yang berisi data Pregnancies, Glucose, BloodPressure, SkinThickness.
* File "patient_A2.csv" merupakan data pasien dari rumah sakit A yang berisi data Insulin, BMI, Diabetes, PedigreeFunction, Age, Outcome.
* File "patient.xlsx" merupakan data pasien dari rumah sakit B yang berisi data 
  - sheet patient_B1: IdPatient, Pregnancies, SkinThickness, BMI, Age, Outcome.
  - sheet patient_B2: IdPatient, Glucose, BloodPressure, DiabetesPedigreeFunction.